---
type: IIFCImporterServer
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 1
tags: [revit-api, class]
---

# IIFCImporterServer

`Autodesk.Revit.DB.IFC.IIFCImporterServer` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ImportIFC | 2014 | `void ImportIFC ( ImporterIFC importer )` |